Pyspark Handling Missing Values

Dropping Columns

Dropping Rows

Various Parameter In Dropping functionalities

Handling Missing values by Mean, MEdian And Mode

In [1]:
from pyspark.sql import SparkSession
spark=SparkSession.builder.appName('Practise').getOrCreate()

In [3]:
df_spark=spark.read.csv('test3.csv',header=True,inferSchema=True)

In [4]:
df_spark.show()

+---------+----+----------+------+
|     name| age|experience|salary|
+---------+----+----------+------+
|  prakhar|  21|         3|900000|
|sudhanshu|  33|         7| 45000|
|    sunny|  19|         1| 70000|
|     paul|  28|         2| 80000|
|  shubham|  30|         7|850000|
|   harsha|  32|      NULL|200000|
|   mahesh|  53|        20|350000|
|     NULL|NULL|      NULL|  NULL|
|     NULL|  34|        10|  NULL|
|     NULL|  36|      NULL|  NULL|
+---------+----+----------+------+

In [5]:
#drop the columns
df_spark.drop('Name').show()

+----+----------+------+
| age|experience|salary|
+----+----------+------+
|  21|         3|900000|
|  33|         7| 45000|
|  19|         1| 70000|
|  28|         2| 80000|
|  30|         7|850000|
|  32|      NULL|200000|
|  53|        20|350000|
|NULL|      NULL|  NULL|
|  34|        10|  NULL|
|  36|      NULL|  NULL|
+----+----------+------+

In [6]:
df_spark.na.drop()

DataFrame[name: string, age: int, experience: int, salary: int]

In [7]:
df_spark.na.drop().show()

+---------+---+----------+------+
|     name|age|experience|salary|
+---------+---+----------+------+
|  prakhar| 21|         3|900000|
|sudhanshu| 33|         7| 45000|
|    sunny| 19|         1| 70000|
|     paul| 28|         2| 80000|
|  shubham| 30|         7|850000|
|   mahesh| 53|        20|350000|
+---------+---+----------+------+

In [8]:
###any=how ## drop thode records which are completely null
df_spark.na.drop(how="all").show()

+---------+---+----------+------+
|     name|age|experience|salary|
+---------+---+----------+------+
|  prakhar| 21|         3|900000|
|sudhanshu| 33|         7| 45000|
|    sunny| 19|         1| 70000|
|     paul| 28|         2| 80000|
|  shubham| 30|         7|850000|
|   harsha| 32|      NULL|200000|
|   mahesh| 53|        20|350000|
|     NULL| 34|        10|  NULL|
|     NULL| 36|      NULL|  NULL|
+---------+---+----------+------+

In [9]:
df_spark.na.drop(how="any").show()

+---------+---+----------+------+
|     name|age|experience|salary|
+---------+---+----------+------+
|  prakhar| 21|         3|900000|
|sudhanshu| 33|         7| 45000|
|    sunny| 19|         1| 70000|
|     paul| 28|         2| 80000|
|  shubham| 30|         7|850000|
|   mahesh| 53|        20|350000|
+---------+---+----------+------+

In [10]:
##threshold  #atleast 2 not null values 
df_spark.na.drop(how='any',thresh=2).show()

+---------+---+----------+------+
|     name|age|experience|salary|
+---------+---+----------+------+
|  prakhar| 21|         3|900000|
|sudhanshu| 33|         7| 45000|
|    sunny| 19|         1| 70000|
|     paul| 28|         2| 80000|
|  shubham| 30|         7|850000|
|   harsha| 32|      NULL|200000|
|   mahesh| 53|        20|350000|
|     NULL| 34|        10|  NULL|
+---------+---+----------+------+

In [11]:
df_spark.na.drop(how='any',thresh=3).show()

+---------+---+----------+------+
|     name|age|experience|salary|
+---------+---+----------+------+
|  prakhar| 21|         3|900000|
|sudhanshu| 33|         7| 45000|
|    sunny| 19|         1| 70000|
|     paul| 28|         2| 80000|
|  shubham| 30|         7|850000|
|   harsha| 32|      NULL|200000|
|   mahesh| 53|        20|350000|
+---------+---+----------+------+

In [12]:
##subset---delect the null values in specific column
df_spark.na.drop(how='any',subset=['age']).show()

+---------+---+----------+------+
|     name|age|experience|salary|
+---------+---+----------+------+
|  prakhar| 21|         3|900000|
|sudhanshu| 33|         7| 45000|
|    sunny| 19|         1| 70000|
|     paul| 28|         2| 80000|
|  shubham| 30|         7|850000|
|   harsha| 32|      NULL|200000|
|   mahesh| 53|        20|350000|
|     NULL| 34|        10|  NULL|
|     NULL| 36|      NULL|  NULL|
+---------+---+----------+------+

In [13]:
df_spark.na.drop(how='any',subset=['experience']).show()

+---------+---+----------+------+
|     name|age|experience|salary|
+---------+---+----------+------+
|  prakhar| 21|         3|900000|
|sudhanshu| 33|         7| 45000|
|    sunny| 19|         1| 70000|
|     paul| 28|         2| 80000|
|  shubham| 30|         7|850000|
|   mahesh| 53|        20|350000|
|     NULL| 34|        10|  NULL|
+---------+---+----------+------+

In [14]:
##filling the missing values
df_spark.na.fill('missing values').show()

+--------------+----+----------+------+
|          name| age|experience|salary|
+--------------+----+----------+------+
|       prakhar|  21|         3|900000|
|     sudhanshu|  33|         7| 45000|
|         sunny|  19|         1| 70000|
|          paul|  28|         2| 80000|
|       shubham|  30|         7|850000|
|        harsha|  32|      NULL|200000|
|        mahesh|  53|        20|350000|
|missing values|NULL|      NULL|  NULL|
|missing values|  34|        10|  NULL|
|missing values|  36|      NULL|  NULL|
+--------------+----+----------+------+

In [15]:
df_spark.na.fill('missing values','experience').show()

+---------+----+----------+------+
|     name| age|experience|salary|
+---------+----+----------+------+
|  prakhar|  21|         3|900000|
|sudhanshu|  33|         7| 45000|
|    sunny|  19|         1| 70000|
|     paul|  28|         2| 80000|
|  shubham|  30|         7|850000|
|   harsha|  32|      NULL|200000|
|   mahesh|  53|        20|350000|
|     NULL|NULL|      NULL|  NULL|
|     NULL|  34|        10|  NULL|
|     NULL|  36|      NULL|  NULL|
+---------+----+----------+------+

In [16]:
df_spark.show()

+---------+----+----------+------+
|     name| age|experience|salary|
+---------+----+----------+------+
|  prakhar|  21|         3|900000|
|sudhanshu|  33|         7| 45000|
|    sunny|  19|         1| 70000|
|     paul|  28|         2| 80000|
|  shubham|  30|         7|850000|
|   harsha|  32|      NULL|200000|
|   mahesh|  53|        20|350000|
|     NULL|NULL|      NULL|  NULL|
|     NULL|  34|        10|  NULL|
|     NULL|  36|      NULL|  NULL|
+---------+----+----------+------+

In [18]:
from pyspark.ml.feature import Imputer

imputer=Imputer(
inputCols=['age','experience','salary'],
outputCols=["{}_imputed".format(c) for c in['age','experience','salary']]
).setStrategy("mean")

In [20]:
#add imputation cols to df
imputer.fit(df_spark).transform(df_spark).show()

+---------+----+----------+------+-----------+------------------+--------------+
|     name| age|experience|salary|age_imputed|experience_imputed|salary_imputed|
+---------+----+----------+------+-----------+------------------+--------------+
|  prakhar|  21|         3|900000|         21|                 3|        900000|
|sudhanshu|  33|         7| 45000|         33|                 7|         45000|
|    sunny|  19|         1| 70000|         19|                 1|         70000|
|     paul|  28|         2| 80000|         28|                 2|         80000|
|  shubham|  30|         7|850000|         30|                 7|        850000|
|   harsha|  32|      NULL|200000|         32|                 7|        200000|
|   mahesh|  53|        20|350000|         53|                20|        350000|
|     NULL|NULL|      NULL|  NULL|         31|                 7|        356428|
|     NULL|  34|        10|  NULL|         34|                10|        356428|
|     NULL|  36|      NULL|  NULL|         36|                 7|        356428|
+---------+----+----------+------+-----------+------------------+--------------+